Revit 2024 API
BuiltInFailures.RebarFailures.SketchFreeFormSet Property
 Sketching of a free form set produces only a single bar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchFreeFormSet { get; }
Visual Basic
Public Shared ReadOnly Property SketchFreeFormSet As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchFreeFormSet {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace